# Pandas_08

In [1]:
#Import The Libriary
import pandas as pd

In [2]:
#Create Data Frame By Using Data
india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})

In [3]:
#Print The Data 
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [4]:
#Create Data Frame By Using Data
usa_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})

In [5]:
#Print The Data 
usa_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [6]:
#Concat The Data
df = pd.concat([india_weather,usa_weather])

In [7]:
#Print The Data
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [8]:
#Concat The Data
df1 = pd.concat([india_weather,usa_weather],ignore_index=True)

In [9]:
#Print The Data
df1

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [10]:
#Concat The Data
df2 = pd.concat([india_weather,usa_weather],keys=['ind','usa'])

In [11]:
#Print The Data
df2

           city  temperature  humidity
ind 0    mumbai           32        80
    1     delhi           45        60
    2  banglore           30        78
usa 0  new york           21        68
    1   chicago           14        65
    2   orlando           35        75

In [13]:
#Print The Data Frame
df2

           city  temperature  humidity
ind 0    mumbai           32        80
    1     delhi           45        60
    2  banglore           30        78
usa 0  new york           21        68
    1   chicago           14        65
    2   orlando           35        75

In [14]:
#Sicling The Data Frame
df2.loc['ind']

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [15]:
#Sicling The Data Frame
df2.loc['usa']

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [21]:
#Create The Dictionary
whether_df={
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30]
    }

In [22]:
#Print the Dictionary
whether_df

{'city': ['mumbai', 'delhi', 'banglore'], 'temperature': [32, 45, 30]}

In [46]:
#Create The Data Frame
temperature=pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30]
    })

In [47]:
#Print The Data Frame
temperature

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [48]:
#Create The Data Frame
windspeed=pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "windspeed": [10,7,15]
    })

In [49]:
#Print The Data Frame
windspeed

       city  windspeed
0    mumbai         10
1     delhi          7
2  banglore         15

In [50]:
#Concat The Two Data Frame
whether_df3 = pd.concat([temperature,windspeed])

In [51]:
#Print The Data Frame
whether_df3

       city  temperature  windspeed
0    mumbai         32.0        NaN
1     delhi         45.0        NaN
2  banglore         30.0        NaN
0    mumbai          NaN       10.0
1     delhi          NaN        7.0
2  banglore          NaN       15.0

In [54]:
#Concat The Two Data Frame
whether_df4 = pd.concat([temperature,windspeed], axis =1)

In [55]:
#Print The Data Frame
whether_df4

       city  temperature      city  windspeed
0    mumbai           32    mumbai         10
1     delhi           45     delhi          7
2  banglore           30  banglore         15

In [60]:
#Create The Data Frame
windspeed1=pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,10]
    })

In [58]:
#Print The Data Frame
windspeed1

     city  windspeed
0   delhi          7
1  mumbai         10

In [62]:
#Create The Data Frame
temperature_df5=pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30]
    },index = [0,1,2])

In [63]:
#Print The Data Frame
temperature_df5

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [64]:
#Create The Data Frame
windspeed1=pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "windspeed": [2,1,0]
    })

In [65]:
#The Data Frame Are Print
windspeed1

       city  windspeed
0    mumbai          2
1     delhi          1
2  banglore          0

In [66]:
#Print The Data Frame
temperature

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [68]:
#Create The Data Series
s = pd.Series(['Humid','Dry','Rain'],name ='event')

In [69]:
#Print The Series of Data
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [71]:
#Create The Data Frame
whether_dfa = pd.concat([temperature,s],axis =1)

In [72]:
#Print The Data Frame
whether_dfa

       city  temperature  event
0    mumbai           32  Humid
1     delhi           45    Dry
2  banglore           30   Rain

-------------------------------------------------------------------------------------------------------------------------------